CSI API ETABS v1
cAreaObj.GetGUID Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGUID(
	string Name,
	ref string GUID
)
Function GetGUID (
	Name As String,
	ByRef GUID As String
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetGUID(Name, GUID)
int GetGUID(
	String^ Name,
	String^% GUID
)
abstract GetGUID :
        Name : string *
        GUID : string byref -> int
Parameters
Name
Type: System.String
GUID
Type: System.String
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace